In [ ]:
from google.colab import files
upload=files.upload()

Saving Fortune3.csv to Fortune3.csv

In [ ]:
import pandas as pd

In [ ]:
df=pd.read_csv("Fortune3.csv")
df

   ID       Name   Companies      Profit Growth
0   1    Lamtone  IT Service   5274555.0    30%
1   2  Stripfind     Finance         NaN    20%
2   3        NaN      Health  47689000.0     7%
3   4        NaN  IT Service  23562500.0    NaN
4   5       Mark   Insurance   4565780.0    26%

In [ ]:
df.head()

   ID       Name   Companies      Profit Growth
0   1    Lamtone  IT Service   5274555.0    30%
1   2  Stripfind     Finance         NaN    20%
2   3        NaN      Health  47689000.0     7%
3   4        NaN  IT Service  23562500.0    NaN
4   5       Mark   Insurance   4565780.0    26%

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         5 non-null      int64
 1   Name       3 non-null      object
 2   Companies  5 non-null      object
 3   Profit     4 non-null      float64
 4   Growth     4 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 328.0+ bytes

In [ ]:
df.describe()

             ID        Profit
count  5.000000  4.000000e+00
mean   3.000000  2.027296e+07
std    1.581139  2.028241e+07
min    1.000000  4.565780e+06
25%    2.000000  5.097361e+06
50%    3.000000  1.441853e+07
75%    4.000000  2.959412e+07
max    5.000000  4.768900e+07

**Fillna**

In [ ]:
#Scalar value
df.fillna(0)

   ID       Name   Companies      Profit Growth
0   1    Lamtone  IT Service   5274555.0    30%
1   2  Stripfind     Finance         0.0    20%
2   3          0      Health  47689000.0     7%
3   4          0  IT Service  23562500.0      0
4   5       Mark   Insurance   4565780.0    26%

In [ ]:
df.fillna(3)

   ID       Name   Companies      Profit Growth
0   1    Lamtone  IT Service   5274555.0    30%
1   2  Stripfind     Finance         3.0    20%
2   3          3      Health  47689000.0     7%
3   4          3  IT Service  23562500.0      3
4   5       Mark   Insurance   4565780.0    26%

In [ ]:
#Applying Dict
df.fillna({"Name":"none",
           "Profit":0,
           "Growth":0})

   ID       Name   Companies      Profit Growth
0   1    Lamtone  IT Service   5274555.0    30%
1   2  Stripfind     Finance         0.0    20%
2   3       none      Health  47689000.0     7%
3   4       none  IT Service  23562500.0      0
4   5       Mark   Insurance   4565780.0    26%

**Metods -> (ffill,bfill,pad) **

In [ ]:
#ffill
df.fillna(method="ffill")

   ID       Name   Companies      Profit Growth
0   1    Lamtone  IT Service   5274555.0    30%
1   2  Stripfind     Finance   5274555.0    20%
2   3  Stripfind      Health  47689000.0     7%
3   4  Stripfind  IT Service  23562500.0     7%
4   5       Mark   Insurance   4565780.0    26%

In [ ]:
#pad
df.fillna(method="pad")

   ID       Name   Companies      Profit Growth
0   1    Lamtone  IT Service   5274555.0    30%
1   2  Stripfind     Finance   5274555.0    20%
2   3  Stripfind      Health  47689000.0     7%
3   4  Stripfind  IT Service  23562500.0     7%
4   5       Mark   Insurance   4565780.0    26%

In [ ]:
#bfill
df.fillna(method="bfill")

   ID       Name   Companies      Profit Growth
0   1    Lamtone  IT Service   5274555.0    30%
1   2  Stripfind     Finance  47689000.0    20%
2   3       Mark      Health  47689000.0     7%
3   4       Mark  IT Service  23562500.0    26%
4   5       Mark   Insurance   4565780.0    26%

In [ ]:
df.fillna(method="ffill",axis=0)

   ID       Name   Companies      Profit Growth
0   1    Lamtone  IT Service   5274555.0    30%
1   2  Stripfind     Finance   5274555.0    20%
2   3  Stripfind      Health  47689000.0     7%
3   4  Stripfind  IT Service  23562500.0     7%
4   5       Mark   Insurance   4565780.0    26%

In [ ]:
df.fillna(method="ffill",axis=1)

  ID       Name   Companies       Profit       Growth
0  1    Lamtone  IT Service  5.27456e+06          30%
1  2  Stripfind     Finance      Finance          20%
2  3          3      Health   4.7689e+07           7%
3  4          4  IT Service  2.35625e+07  2.35625e+07
4  5       Mark   Insurance  4.56578e+06          26%

In [ ]:
df.fillna(method="bfill",axis=1)

  ID        Name   Companies       Profit Growth
0  1     Lamtone  IT Service  5.27456e+06    30%
1  2   Stripfind     Finance          20%    20%
2  3      Health      Health   4.7689e+07     7%
3  4  IT Service  IT Service  2.35625e+07    NaN
4  5        Mark   Insurance  4.56578e+06    26%

In [ ]:
#limit
df.fillna(0,limit=1)

   ID       Name   Companies      Profit Growth
0   1    Lamtone  IT Service   5274555.0    30%
1   2  Stripfind     Finance         0.0    20%
2   3          0      Health  47689000.0     7%
3   4        NaN  IT Service  23562500.0      0
4   5       Mark   Insurance   4565780.0    26%

In [ ]:
df.fillna(0,limit=2)

   ID       Name   Companies      Profit Growth
0   1    Lamtone  IT Service   5274555.0    30%
1   2  Stripfind     Finance         0.0    20%
2   3          0      Health  47689000.0     7%
3   4          0  IT Service  23562500.0      0
4   5       Mark   Insurance   4565780.0    26%

In [ ]:
df.fillna(method="ffill",limit=1)

   ID       Name   Companies      Profit Growth
0   1    Lamtone  IT Service   5274555.0    30%
1   2  Stripfind     Finance   5274555.0    20%
2   3  Stripfind      Health  47689000.0     7%
3   4        NaN  IT Service  23562500.0     7%
4   5       Mark   Insurance   4565780.0    26%

In [ ]:
df.fillna(method="ffill",limit=2)

   ID       Name   Companies      Profit Growth
0   1    Lamtone  IT Service   5274555.0    30%
1   2  Stripfind     Finance   5274555.0    20%
2   3  Stripfind      Health  47689000.0     7%
3   4  Stripfind  IT Service  23562500.0     7%
4   5       Mark   Insurance   4565780.0    26%

In [ ]:
#inplace
df.fillna(5,inplace=True)
df

   ID       Name   Companies      Profit Growth
0   1    Lamtone  IT Service   5274555.0    30%
1   2  Stripfind     Finance         5.0    20%
2   3          5      Health  47689000.0     7%
3   4          5  IT Service  23562500.0      5
4   5       Mark   Insurance   4565780.0    26%

In [ ]:
from google.colab import files
upload=files.upload()

Saving Fortune4.csv to Fortune4.csv

In [ ]:
import pandas as pd

In [ ]:
df=pd.read_csv("Fortune4.csv")
df

   ID             Name             Industry    Profit Growth
0   1          Lamtone          IT Services   5274553    30%
1   2        stripfind   Financial Services  11412916    20%
2   3  Canecorporation               Health         0     7%
3   4         Mattouch          IT Services         0    26%
4   5        Techdrill            no values         0     8%
5   6         Techline            no values   8427816    23%
6   7          Cityace                  NaN   3005116    16%
7   8    Kayelectronic                  NaN   5573830     4%
8   9          Ganzlax          IT Services  11907780    18%
9  10      Trantraxlax  Government Services   5453060     7%

Replace

In [ ]:
#to_replace
df.replace(to_replace="Health",value="Finance")

   ID             Name             Industry    Profit Growth
0   1          Lamtone          IT Services   5274553    30%
1   2        stripfind   Financial Services  11412916    20%
2   3  Canecorporation              Finance         0     7%
3   4         Mattouch          IT Services         0    26%
4   5        Techdrill            no values         0     8%
5   6         Techline            no values   8427816    23%
6   7          Cityace                  NaN   3005116    16%
7   8    Kayelectronic                  NaN   5573830     4%
8   9          Ganzlax          IT Services  11907780    18%
9  10      Trantraxlax  Government Services   5453060     7%

In [ ]:
#replace 10 with given input 15
df.replace(10,15)

   ID             Name             Industry    Profit Growth
0   1          Lamtone          IT Services   5274553    30%
1   2        stripfind   Financial Services  11412916    20%
2   3  Canecorporation               Health         0     7%
3   4         Mattouch          IT Services         0    26%
4   5        Techdrill            no values         0     8%
5   6         Techline            no values   8427816    23%
6   7          Cityace                  NaN   3005116    16%
7   8    Kayelectronic                  NaN   5573830     4%
8   9          Ganzlax          IT Services  11907780    18%
9  15      Trantraxlax  Government Services   5453060     7%

In [ ]:
#List
df.replace([1,2,3,4,5,6,7,8,9,10],0)

   ID             Name             Industry    Profit Growth
0   0          Lamtone          IT Services   5274553    30%
1   0        stripfind   Financial Services  11412916    20%
2   0  Canecorporation               Health         0     7%
3   0         Mattouch          IT Services         0    26%
4   0        Techdrill            no values         0     8%
5   0         Techline            no values   8427816    23%
6   0          Cityace                  NaN   3005116    16%
7   0    Kayelectronic                  NaN   5573830     4%
8   0          Ganzlax          IT Services  11907780    18%
9   0      Trantraxlax  Government Services   5453060     7%

In [ ]:
#List
df.replace([1,2,3,4,5,6,7,8,9,10],[11,12,13,14,15,16,17,18,19,20])

   ID             Name             Industry    Profit Growth
0  11          Lamtone          IT Services   5274553    30%
1  12        stripfind   Financial Services  11412916    20%
2  13  Canecorporation               Health         0     7%
3  14         Mattouch          IT Services         0    26%
4  15        Techdrill            no values         0     8%
5  16         Techline            no values   8427816    23%
6  17          Cityace                  NaN   3005116    16%
7  18    Kayelectronic                  NaN   5573830     4%
8  19          Ganzlax          IT Services  11907780    18%
9  20      Trantraxlax  Government Services   5453060     7%

In [ ]:
#Dict
df.replace({"Industry":"Health"},"none")

   ID             Name             Industry    Profit Growth
0   1          Lamtone          IT Services   5274553    30%
1   2        stripfind   Financial Services  11412916    20%
2   3  Canecorporation                 none         0     7%
3   4         Mattouch          IT Services         0    26%
4   5        Techdrill            no values         0     8%
5   6         Techline            no values   8427816    23%
6   7          Cityace                  NaN   3005116    16%
7   8    Kayelectronic                  NaN   5573830     4%
8   9          Ganzlax          IT Services  11907780    18%
9  10      Trantraxlax  Government Services   5453060     7%

In [ ]:
df.replace({"Industry":"Health",
           "Profit":0}, "none")

   ID             Name             Industry    Profit Growth
0   1          Lamtone          IT Services   5274553    30%
1   2        stripfind   Financial Services  11412916    20%
2   3  Canecorporation                 none      none     7%
3   4         Mattouch          IT Services      none    26%
4   5        Techdrill            no values      none     8%
5   6         Techline            no values   8427816    23%
6   7          Cityace                  NaN   3005116    16%
7   8    Kayelectronic                  NaN   5573830     4%
8   9          Ganzlax          IT Services  11907780    18%
9  10      Trantraxlax  Government Services   5453060     7%

In [ ]:
#regex(Regular Expression)
df.replace("[A-Za-z]",0)

   ID             Name             Industry    Profit Growth
0   1          Lamtone          IT Services   5274553    30%
1   2        stripfind   Financial Services  11412916    20%
2   3  Canecorporation               Health         0     7%
3   4         Mattouch          IT Services         0    26%
4   5        Techdrill            no values         0     8%
5   6         Techline            no values   8427816    23%
6   7          Cityace                  NaN   3005116    16%
7   8    Kayelectronic                  NaN   5573830     4%
8   9          Ganzlax          IT Services  11907780    18%
9  10      Trantraxlax  Government Services   5453060     7%

In [ ]:
#It Replace Srting values to Int
df.replace("[A-Za-z]",0,regex=True)

   ID  Name  Industry    Profit Growth
0   1     0       0.0   5274553    30%
1   2     0       0.0  11412916    20%
2   3     0       0.0         0     7%
3   4     0       0.0         0    26%
4   5     0       0.0         0     8%
5   6     0       0.0   8427816    23%
6   7     0       NaN   3005116    16%
7   8     0       NaN   5573830     4%
8   9     0       0.0  11907780    18%
9  10     0       0.0   5453060     7%

In [ ]:
df.replace({"Industry":"[A-Za-z]"},0,regex=True)

   ID             Name  Industry    Profit Growth
0   1          Lamtone       0.0   5274553    30%
1   2        stripfind       0.0  11412916    20%
2   3  Canecorporation       0.0         0     7%
3   4         Mattouch       0.0         0    26%
4   5        Techdrill       0.0         0     8%
5   6         Techline       0.0   8427816    23%
6   7          Cityace       NaN   3005116    16%
7   8    Kayelectronic       NaN   5573830     4%
8   9          Ganzlax       0.0  11907780    18%
9  10      Trantraxlax       0.0   5453060     7%

In [ ]:
df.replace(0,method="ffill",limit=1)

   ID             Name             Industry    Profit Growth
0   1          Lamtone          IT Services   5274553    30%
1   2        stripfind   Financial Services  11412916    20%
2   3  Canecorporation               Health  11412916     7%
3   4         Mattouch          IT Services         0    26%
4   5        Techdrill            no values         0     8%
5   6         Techline            no values   8427816    23%
6   7          Cityace                  NaN   3005116    16%
7   8    Kayelectronic                  NaN   5573830     4%
8   9          Ganzlax          IT Services  11907780    18%
9  10      Trantraxlax  Government Services   5453060     7%

In [ ]:
#inplace
df.replace(0,100,inplace=True)
df

   ID             Name             Industry    Profit Growth
0   1          Lamtone          IT Services   5274553    30%
1   2        stripfind   Financial Services  11412916    20%
2   3  Canecorporation               Health       100     7%
3   4         Mattouch          IT Services       100    26%
4   5        Techdrill            no values       100     8%
5   6         Techline            no values   8427816    23%
6   7          Cityace                  NaN   3005116    16%
7   8    Kayelectronic                  NaN   5573830     4%
8   9          Ganzlax          IT Services  11907780    18%
9  10      Trantraxlax  Government Services   5453060     7%

**Merging**

In [ ]:
import pandas as pd

In [ ]:
df1=pd.DataFrame({"ID":[1,2,3,4],
                  "Class":[9,10,11,12]})
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [ ]:
df2=pd.DataFrame({"ID":[1,2,3,5],
                  "Name":["A","B","C","D"]})
df2

   ID Name
0   1    A
1   2    B
2   3    C
3   5    D

In [ ]:
pd.merge(df1,df2,on="ID")

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C

In [ ]:
pd.merge(df1,df2,on="ID", how="inner")

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C

In [ ]:
pd.merge(df1,df2,on="ID",how="left")

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12  NaN

In [ ]:
pd.merge(df1,df2,on="ID",how="right")

   ID  Class Name
0   1    9.0    A
1   2   10.0    B
2   3   11.0    C
3   5    NaN    D

In [ ]:
pd.merge(df1,df2,on="ID",how="outer")

   ID  Class Name
0   1    9.0    A
1   2   10.0    B
2   3   11.0    C
3   4   12.0  NaN
4   5    NaN    D

In [ ]:
#Indicator
pd.merge(df1,df2,on="ID",how="outer",indicator=True)

   ID  Class Name      _merge
0   1    9.0    A        both
1   2   10.0    B        both
2   3   11.0    C        both
3   4   12.0  NaN   left_only
4   5    NaN    D  right_only

In [ ]:
df1=pd.DataFrame({"ID":[1,2,3,4],
                  "Class":[9,10,11,12]})
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [ ]:
df2=pd.DataFrame({"ID":[5,6,7,8],
                  "Name":["A","B","C","D"]})
df2

   ID Name
0   5    A
1   6    B
2   7    C
3   8    D

In [ ]:
#left_index
#right_index
pd.merge(df1,df2,left_index=True,right_index=True)

   ID_x  Class  ID_y Name
0     1      9     5    A
1     2     10     6    B
2     3     11     7    C
3     4     12     8    D

**Concat() Function**
Pandas provides various facilities for easily combining together series,DataFrame ans panel objects

In [48]:
import pandas as pd

In [49]:
sr1=pd.Series([1,2,3])
sr1

0    1
1    2
2    3
dtype: int64

In [50]:
sr2=pd.Series([3,4,5])
sr2

0    3
1    4
2    5
dtype: int64

In [51]:
#concat
pd.concat([sr1,sr2])

0    1
1    2
2    3
0    3
1    4
2    5
dtype: int64

In [52]:
sr1=pd.Series([0,1,2])
sr1

0    0
1    1
2    2
dtype: int64

In [53]:
sr2=pd.Series([3,4,5,6,7])
sr2

0    3
1    4
2    5
3    6
4    7
dtype: int64

In [54]:
#concat unequal Series
pd.concat([sr1,sr2])

0    0
1    1
2    2
0    3
1    4
2    5
3    6
4    7
dtype: int64